Repository: Etersoft/eepm
Catalog: po/eepm.po
Languages: ru

source: APT DB is up to date
ru: База данных APT самой новой версии

source: Can't find commented $1 in the repos (see # epm repolist output)
ru: Не удаётся найти закомментированный $1 в репозиториях (см. вывод # epm repolist)

source: will uncomment $rp
ru: будет раскомментировано $rp

source: sudo requires a password, skip apt-file update
ru: sudo требует пароль, пропускаем обновление apt-file

source: Query filelist for non installed packages is not implemented yet.
ru: Запрос списка файлов для неустановленных пакетов еще не реализован.

source: Query filelist for non installed packages is not implemented yet
ru: Запрос списка файлов для неустановленных пакетов еще не реализован

source: Filelist: package name is missed
ru: Список файлов: отсутствует название пакета

source: Tools embedded in epm:
ru: Инструменты, встроенные в epm:

source: Examples: epm tool eget -U http://ya.ru epm tool estrlist union a b a c epm tool erc archive.zip
ru: Примеры: epm tool eget -U http://ya.ru epm tool estrlist union a b a c epm tool erc archive.zip

source: Use epm tool --help to get help.
ru: Используйте epm tool --help для получения помощи.

source: Unknown command $ epm tool $WHAT. Use epm print help for get help.
ru: Неизвестная команда $ epm tool $WHAT. Используйте epm print help для получения помощи.

source: .ebuild file $EBUILD is missed
ru: Файл .ebuild $EBUILD отсутствует

source: Can't load SRC_URI from $EBUILD
ru: Не удается загрузить SRC_URI из $EBUILD

source: We still have no idea how to use package repository, ever if it is F-Droid.
ru: Мы до сих пор не знаем, как использовать репозиторий пакетов, даже если это F-Droid.

source: When you ask Nix to install a package, it will first try to get it in pre-compiled form from a binary cache. By default, Nix will use the binary cache https://cache.nixos.org; it contains binaries for most packages in Nixpkgs. Only if no binary is available in the binary cache, Nix will build the package from source.
ru: Когда вы просите Nix установить пакет, он сначала попытается получить его в предварительно скомпилированной форме из бинарного кэша. По умолчанию Nix будет использовать бинарный кэш https://cache.nixos.org; он содержит бинарные файлы для большинства пакетов в Nixpkgs. Только если бинарный файл недоступен в бинарном кэше, Nix соберет пакет из исходников.

source: Have no suitable install command for $PMTYPE
ru: Нет подходящей команды для установки для $PMTYPE

source: Have no suitable appropriate install command for $PMTYPE
ru: Нет подходящей команды для установки для $PMTYPE

source: Empty install list was skipped
ru: Пропускаем пустой список для установки

source: Empty install list was skipped (filtered out, all requested packages is already installed)
ru: Пропускаем пустой список для установки (отфильтровано, все запрошенные пакеты уже установлены)

source: Empty install files list was skipped
ru: Пропускаем пустой список файлов для установки

source: Please send me the correct command form for it
ru: Пожалуйста, пришлите мне правильную форму команды для этого

source: Reinstall: package name is missed.
ru: Переустановка: название пакета отсутствует.

source: Can't set executable permission
ru: Не удаётся установить права на выполнение

source: Could not find gzip package. Please install gzip package and retry.
ru: Не удалось найти пакет gzip. Пожалуйста, установите пакет gzip и попробуйте снова.

source: Need two args
ru: Необходимо два аргумента

source: Output file is the same as input
ru: Выходной файл совпадает с входным

source: $t is not PyPi requirement, skipped
ru: $t не является требованием PyPi, пропускаем

source: $t is darwin only requirement, skipped
ru: $t является требованием только для darwin, пропускаем

source: $t is win32 only requirement, skipped
ru: $t является требованием только для win32, пропускаем

source: $t is python2 only requirement, skipped
ru: $t является требованием только для python2, пропускаем

source: Install requirements from $req_file ...
ru: Устанавливаем требования из $req_file ...

source: Checking for $req_file ...
ru: Проверка $req_file ...

source: Repo dir $REPO_DIR does not exist
ru: Каталог репозитория $REPO_DIR не существует

source: Examples: epm repo set p9 - clean all sources and add default repo for p9 branch epm repo set c10f1 - clean all sources and add default repo for c10f1 branch epm repo switch p10 - change only branch name to p10 epm repo add autoimports - add autoimports (from Fedora) repo epm repo change yandex - change only base url part to mirror.yandex.ru server (use epm repo change --list to get possible targets) epm repo list - list current repos
ru: Примеры: epm repo set p9 - очистить все источники и добавить репозиторий по умолчанию для ветки p9 epm repo set c10f1 - очистить все источники и добавить репозиторий по умолчанию для ветки c10f1 epm repo switch p10 - изменить только название ветки на p10 epm repo add autoimports - добавить репозиторий autoimports (из Fedora) epm repo change yandex - изменить только базовую часть url на сервер mirror.yandex.ru (epm repo change --list покажет все возможные варианты) epm repo list - показать текущие репозитории

source: No valid repository is specified.
ru: Не указано корректных репозиториев.

source: You are about to set repo
ru: Вы собираетесь установить репозиторий

source: Unknown command $ epm repo $CMD
ru: Неизвестная команда $ epm repo $CMD

source: Have no suitable command for $1
ru: Нет подходящей команды для $1

source: Have no suitable command for $PMTYPE. Try install the package firstly.
ru: Нет подходящей команды для $PMTYPE. Попробуйте сначала установить пакет.

source: Changelog: Missing package(s) name
ru: Журнал изменений: Отсутствует название пакета(ов)

source: Don't use --use-7z and --use-patool simulateously.
ru: Не используйте --use-7z и --use-patool одновременно.

source: Could not find any patool or 7-zip backend. Please install p7zip package and retry.
ru: Не удалось найти backend для patool или 7-zip. Пожалуйста, установите пакет p7zip и попробуйте снова.

source: /etc/apt/preferences already exists
ru: /etc/apt/preferences уже существует

source: Running with /etc/apt/preferences:
ru: Запуск с /etc/apt/preferences:

source: Downloading packages assigned to downgrade ...
ru: Скачивание пакетов, назначенных для понижения версии ...

source: Running command for downgrade packages
ru: Запуск команды для понижения версии пакетов

source: There is .rpmnew file(s) in $psdir dir. The play script can be outdated.
ru: В каталоге $psdir есть файл(ы) .rpmnew. Скрипт play может быть устаревшим.

source: We have no idea how to remove $prescription (checked in $psdir and $prsdir)
ru: Неизвестно, как удалить $prescription (проверено в $psdir и $prsdir)

source: There was some error during run the script.
ru: Произошла ошибка при выполнении скрипта.

source: There is .rpmnew file(s) in $EPM_REPACK_SCRIPTS_DIR dir. The pack script can be outdated.
ru: В каталоге $EPM_REPACK_SCRIPTS_DIR есть файл(ы) .rpmnew. Скрипт упаковки может быть устаревшим.

source: There is an error from $repackcode script
ru: Возникла ошибка в скрипте $repackcode

source: will use eepm-rpmbuild for rpm packing
ru: будет использован eepm-rpmbuild для упаковки rpm

source: Repacking $abspkg to local rpm format (inside $tmpbuilddir) ...
ru: Переупаковка $abspkg в локальный формат rpm (внутри $tmpbuilddir) ...

source: can't find subdir in
ru: не удаётся найти подкаталог в

source: Some bug: the name of the repacking package ($pkgname) differs with the package name ($EEPM_INTERNAL_PKGNAME) from play.d script.
ru: Ошибка: название переупаковываемого пакета ($pkgname) отличается от имени пакета ($EEPM_INTERNAL_PKGNAME) из скрипта play.d.

source: Can't find converted rpm for source binary package $pkg (got $repacked_rpm)
ru: Не удаётся найти преобразованный rpm для исходного бинарного пакета $pkg (получен $repacked_rpm)

source: package management list
ru: список управления пакетами

source: Examples: epm packages --sort epm packages --sort=size epm packages --last
ru: Примеры: epm packages --sort epm packages --sort=size epm packages --last

source: Sorted package list function is not implemented for $PMTYPE
ru: Функция сортировки списка пакетов не реализована для $PMTYPE

source: Unknown option $1. Use epm packages --help to get help.
ru: Неизвестный параметр $1. Используйте epm packages --help для получения справки.

source: Usage: epm play [options] [<app>] Options: <app> - install <app> --remove <app> - uninstall <app> --update [<app>|all] - update <app> (or all installed apps) if there is new version --latest <app> - forced to install the latest version of the application --list - list all installed apps --list-all - list all available apps --list-scripts - list all available scripts --short (with --list) - list names only --installed <app> - check if the app is installed --ipfs <app> - use IPFS for downloading --product-alternatives- list alternatives (use like epm play app=beta) Examples: epm play --remove opera epm play yandex-browser = beta epm play telegram = beta epm play telegram = 4.7.1 epm play --update all
ru: Использование: epm play [параметр] [<приложение>] Параметры: <приложение> - установить <приложение> --remove <приложение> - удалить <приложение> --update [<приложение>|all] - обновить <приложение> (или все установленные приложения), если есть новая версия --latest <приложение> - принудительно установить последнюю версию приложения --list - показать все установленные приложения --list-all - показать все доступные приложения --list-scripts - показать все доступные скрипты --short (с --list) - показать только имена --installed <приложение> - проверить, установлено ли приложение --ipfs <app> - использовать IPFS for загрузки --product-alternatives- показать альтернативы (используйте, как epm play app=beta) Примеры: epm play --remove opera epm play yandex-browser = beta epm play telegram = beta epm play telegram = 4.7.1 epm play --update all

source: There was some error during install the application.
ru: Произошла ошибка при установке приложения.

source: Can't update IPFS DB
ru: Не удается обновить базу данных IPFS

source: epm play is not supported in single file mode
ru: epm play не поддерживается в режиме одного файла

source: run --remove with 'all' or a project name
ru: запустите --remove с 'all' или именем проекта

source: Retrieving list of installed apps ...
ru: Получение списка установленных приложений ...

source: run --update with 'all' or a project name
ru: запустите --update с 'all' или именем проекта

source: empty repo name
ru: пустое название репозитория

source: No such repo or task. Use epm repo remove <regexp|autoimports|archive|tasks|TASKNUMBER>
ru: Нет такого репозитория или задачи. Используйте epm repo remove <regexp|autoimports|archive|tasks|TASKNUMBER>

source: removing autoimports repo
ru: удаление репозитория autoimports

source: Empty DISTRVERSION
ru: Пустая DISTRVERSION

source: removing archive repos
ru: удаление архивных репозиториев

source: removing korinf repo
ru: удаление репозитория korinf

source: removing cdroms entries
ru: удаление записей о cdrom

source: removing tasks' repos
ru: удаление репозиториев задач

source: removing all repos
ru: удаление всех репозиториев

source: epm removerepo: no options are supported
ru: epm removerepo: не поддерживаются параметры

source: Check file /etc/apt/sources.list if needed
ru: При необходимости проверьте файл /etc/apt/sources.list

source: You need remove repo from /etc/apt/sources.list
ru: Вам нужно удалить репозиторий из /etc/apt/sources.list

source: You need remove repo from /etc/pacman.conf
ru: Вам нужно удалить репозиторий из /etc/pacman.conf

source: You need remove repo from /etc/slackpkg/mirrors
ru: Вам нужно удалить репозиторий из /etc/slackpkg/mirrors

source: There was some error in contents index retrieving. Try run 'epm update' again.
ru: Произошла ошибка при получении индекса содержимого. Попробуйте снова запустить 'epm update'.

source: Searching for
ru: Ищем

source: Search file: file name is missed
ru: Поиск файла: название файла отсутствует

source: Search by full packages list is not implemented yet
ru: Поиск по полному списку пакетов еще не реализован

source: Have no suitable search file command for $PMTYPE
ru: Нет подходящей команды поиска файла для $PMTYPE

source: Can't find repo dir $REPO_DIR.
ru: Не удаётся найти каталог репозитория $REPO_DIR.

source: Missed package name
ru: Отсутствует название пакета

source: There is repack rule for $pkgname package. It is better install this package via epm install --repack or epm play.
ru: Существует правило переупаковки для пакета $pkgname. Лучше установить этот пакет через epm install --repack или epm play.

source: Please use official package instead of $alpkg repacking (It is not recommended to use --force to skip this checking.
ru: Пожалуйста, используйте официальный пакет вместо переупакованного $alpkg (не рекомендуется использовать --force для пропуска этой проверки).

source: Can't read result from pack: $returntarname is not a readable file.
ru: Не удается прочитать результат pack: $returntarname не является читаемым файлом.

source: $PKGFORMAT is not supported for repack yet
ru: $PKGFORMAT пока не поддерживается для переупаковки

source: Error with $pkg repacking.
ru: Ошибка при переупаковке $pkg.

source: Can't find $pkg_names files
ru: Не удается найти файлы $pkg_names

source: Empty repack list was skipped
ru: Пропущен пустой список переупаковки

source: Adapted packages:
ru: Адаптированные пакеты:

source: File or directory $CMD is already exists.
ru: Файл или каталог $CMD уже существует.

source: You need run with package name param when use with absolute path to non executable file
ru: Необходимо запускать с названием пакета в качестве параметра при использовании абсолютного путя к неисполняемым файлам

source: Command $CMD is exists: $compath
ru: Команда $CMD существует: $compath

source: Installing appropriate package for $CMD command...
ru: Установка соответствующего пакета для команды $CMD...

source: Can't assure in $CMD command from $PACKAGE$textpackage package
ru: Не удается убедиться в наличии команды $CMD из пакета $PACKAGE$textpackage

source: Unknown command for get source package name via dpkg
ru: Неизвестная команда для получения имени исходного пакета через dpkg

source: Examples: epm print info [args] print system and distro info (via distro_info command) epm print name [from filename|for package] NN print only name of package name or package file epm print shortname [for package] NN print only short name of package name epm print version [from filename|for package] NN print only version of package name or package file epm print release [from filename|for package] NN print only release of package name or package file epm print version-release [from filename|for package] NN print only release-release of package name or package file epm print arch [from filename|for package] NN print arch of package name or package file epm print field FF for package NN print field of the package epm print pkgname from filename NN print package name for the package file epm print srcname from filename NN print source name for the package file epm print srcpkgname from [filename|package] NN print source package name for the binary package file epm print specname from filename NN print spec filename for the source package file epm print binpkgfilelist in DIR for NN list binary package(s) filename(s) from DIR for the source package file epm print compare [package] version N1 N2 compare (package) versions and print -1 (N1 < N2), 0 (N1 == N2), 1 (N1 > N2) epm print enough [package version] package version returns true if the package with the version or above is installed epm print constructname <name> <version> [arch] [pkgtype] [delimiter1] [delimiter2] print distro dependend package filename from args name version arch pkgtype
ru: Примеры: epm print info [аргументы] вывод информации о системе и дистрибутиве (с помощью команды distro_info) epm print name [from filename|for package] NN вывод только имени имени пакета или файла пакета epm print shortname [for package] NN вывод только короткого имени имени пакета epm print version [from filename|for package] NN вывод только версии имени пакета или файла пакета epm print release [from filename|for package] NN вывод только релиза имени пакета или файла пакета epm print version-release [from filename|for package] NN вывод только релиза-релиза имени пакета или файла пакета epm print arch [from filename|for package] NN вывод архитектуры имени имени пакета или файла пакета epm print field FF for package NN вывод поля пакета epm print pkgname from filename NN вывод имени пакета для файла пакета epm print srcname from filename NN вывод имени источника для файла пакета epm print srcpkgname from [filename|package] NN вывод имени исходного пакета для бинарного файла пакета epm print specname from filename NN вывод имени файла spec для исходного пакета epm print binpkgfilelist in DIR for NN список имен файлов бинарных пакетов из DIR для исходного файла пакета epm print compare [package] version N1 N2 сравнение (пакета) версий и вывод -1 (N1 < N2), 0 (N1 == N2), 1 (N1 > N2) epm print enough [package version] package version возвращает true, если установлен пакет с данной версией или выше epm print constructname <name> <version> [arch] [pkgtype] [delimiter1] [delimiter2] вывод имени файла пакета в зависимости от дистрибутива из аргументов name version arch pkgtype

source: Use epm print --help to get help.
ru: Используйте epm print --help для получения справки.

source: Arg is missed
ru: Аргумент отсутствует

source: print $WHAT works only for filename(s)
ru: print $WHAT работает только для файла(ов)

source: DIR arg is missed
ru: Аргумент DIR отсутствует

source: source package filename is missed
ru: Название файла исходного пакета отсутствует

source: Unknown command $ epm print $WHAT. Use epm print help for get help.
ru: Неизвестная команда $ epm print $WHAT. Используйте epm print help для получения помощи.

source: Running services:
ru: Запущенные службы:

source: Add repo. 1. Use with repository URL, f.i. http://www.example.com/example.repo 2. Use with epel to add EPEL repository 3. Use with powertools to add PowerTools repository 4. Use with crb to add Rocky Linux CRB repository
ru: Добавить репозиторий. 1. Используйте с URL репозитория, например, http://www.example.com/example.repo 2. Используйте epel для добавления репозитория EPEL 3. Используйте powertools для добавления репозитория PowerTools 4. Используйте crb для добавления репозитория CRB Rocky Linux

source: use follow date format: 2017/01/31 or 2017-01-31
ru: используйте следующий формат даты: 2017/01/31 или 2017-01-31

source: only for rpm repo
ru: только для rpm репозитория

source: epm repo add - add branch repo. Use follow params: basealt - for BaseALT repo altsp - add ALT SP repo yandex - for BaseALT repo mirror hosted by Yandex (recommended) autoimports - for BaseALT autoimports repo autoports - for Autoports repo (with packages from Sisyphus rebuilt to the branch) altlinuxclub - for altlinuxclub repo (http://altlinuxclub.ru/) deferred - for Etersoft Sisyphus Deferred repo deferred.org - for Etersoft Sisyphus Deferred repo (at mirror.eterfund.org) etersoft - for LINUX@Etersoft repo korinf - for Korinf repo ximper - for Ximper Linux repo <task number> - add task repo archive 2018/02/09 - add archive of the repo from that date /dir/to/repo [component] - add repo dir generated with epm repo index --init URL [arch] [component] - add repo by URL Examples: # epm repo add yandex # epm repo add "rpm http://somesite/pub/product x86_64 addon # epm repo add /var/ftp/pub/altlinux/p10
ru: epm repo add - добавить репозиторий ветки. Используйте следующие параметры: basealt - для репозитория BaseALT altsp - добавить репозиторий ALT SP yandex - для зеркала репозитория BaseALT, размещенного на Yandex (рекомендуется) autoimports - для репозитория BaseALT autoimports autoports - для репозитория Autoports (с пакетами из Sisyphus, пересобранными для ветки) altlinuxclub - для репозитория altlinuxclub (http://altlinuxclub.ru/) deferred - для репозитория Etersoft Sisyphus Deferred deferred.org - для репозитория Etersoft Sisyphus Deferred (на mirror.eterfund.org) etersoft - для репозитория LINUX@Etersoft korinf - для репозитория Korinf ximper - для репозитория Ximper Linux <номер задачи> - добавить репозиторий задачи archive 2018/02/09 - добавить архив репозитория с этой даты /dir/to/repo [компонент] - добавить каталог репозитория, созданный с помощью epm repo index --init URL [арх] [компонент] - добавить репозиторий по URL Примеры: # epm repo add yandex # epm repo add "rpm http://somesite/pub/product x86_64 addon # epm repo add /var/ftp/pub/altlinux/p10

source: Ximper Linux repo is applicable to Sisyphus only
ru: Ximper Linux repo можно добавить только к репозиторию ALT Sisyphus

source: Etersoft Sisyphus Deferred supported only for ALT Sisyphus based systems.
ru: Etersoft Sisyphus Deferred поддерживается только для систем, основанных на ALT Sisyphus.

source: Add repo. You can use follow params: distribution component name full sources list line URL version component
ru: Добавить репозиторий. Вы можете использовать следующие параметры: название компонента дистрибутива полная строка списка источников версия URL компонента

source: Astra repo is already in the list
ru: Репозиторий Astra уже в списке

source: Unsupported distro version $1-$reponame, see # epm print info output.
ru: Неподдерживаемая версия дистрибутива $1-$reponame, см. вывод epm print info.

source: Only URL is supported
ru: Поддерживается только URL

source: Add repo. You can use follow params: docker - add official docker repo ppa:<user>/<ppa-name> - add PPA repo distribution component name full sources list line URL version component
ru: Добавить репозиторий. Вы можете использовать следующие параметры: docker - добавить официальный репозиторий docker ppa:<user>/<ppa-name> - добавить репозиторий PPA название компонента дистрибутива полная строка списка источников версия URL компонента

source: You need manually add repo to /etc/apt/sources.list (TODO)
ru: Вам нужно вручную добавить репозиторий в /etc/apt/sources.list (TODO)

source: You need manually add repo to /etc/pacman.conf
ru: Вам нужно вручную добавить репозиторий в /etc/pacman.conf

source: You need manually add repo to /etc/slackpkg/mirrors
ru: Вам нужно вручную добавить репозиторий в /etc/slackpkg/mirrors

source: Incorrect true status from eget. No saved files from download $url, ignoring
ru: Некорректный истинный статус от eget. Нет сохраненных файлов из загрузки $url, игнорируется

source: Can't get filename
ru: Не удается получить название файла

source: Latest release:
ru: Последний релиз:

source: Size:
ru: Размер:

source: Packages from task(s): $installlist
ru: Пакеты из задач: $installlist

source: Cleaning apt cache for correct result ...
ru: Очистка кэша apt для корректного результата ...

source: No installed kernel packages, skipping cleaning
ru: Нет установленных пакетов ядра, пропускается очистка

source: Note: it is enough to use eepm autoremove for old kernel removing...
ru: Примечание: достаточно использовать eepm autoremove для удаления старого ядра...

source: Check also http://ubuntuhandbook.org/index.php/2016/05/remove-old-kernels-ubuntu-16-04/
ru: Также проверьте http://ubuntuhandbook.org/index.php/2016/05/remove-old-kernels-ubuntu-16-04/
