Repository: Etersoft/eepm
Catalog: po/eepm.po
Languages: ru

source: You can run with --interactive if you can skip some steps interactively. Also you can comment out full_upgrade parts in /etc/eepm/eepm.conf config. Examples: epm full-upgrade [--auto] epm full-upgrade [--interactive] epm full-upgrade --no-flatpak
ru: Вы можете запустить с --interactive, если можете пропустить некоторые шаги интерактивно. Также вы можете закомментировать части full_upgrade в конфигурации /etc/eepm/eepm.conf. Примеры: epm full-upgrade [--auto] epm full-upgrade [--interactive] epm full-upgrade --no-flatpak

source: Are you sure? [Y/n]
ru: Вы уверены? [Y/n]

source: Update repository info? [Y/n]
ru: Обновить информацию о репозитории? [Y/n]

source: repository updating is failed.
ru: Ошибка обновления репозитория.

source: Do upgrade epm? [Y/n]
ru: Обновить epm? [Y/n]

source: An update for epm has been found, epm will be restarted for the update
ru: Найдено обновление для epm, epm будет перезапущен для обновления

source: Do upgrade installed packages? [Y/n]
ru: Обновить установленные пакеты? [Y/n]

source: upgrading of the system is failed.
ru: обновление системы не удалось.

source: Upgrade kernel and kernel modules? [Y/n]
ru: Обновить ядро и модули ядра? [Y/n]

source: updating of the kernel is failed.
ru: обновление ядра не удалось.

source: Upgrade packages installed via epm play? [Y/n]
ru: Обновить пакеты, установленные через epm play? [Y/n]

source: Upgrade installed flatpak packages? [Y/n]
ru: Обновить установленные пакеты flatpak? [Y/n]

source: Upgrade installed snap packages? [Y/n]
ru: Обновить установленные пакеты snap? [Y/n]

source: Do epm clean? [Y/n]
ru: Выполнить очистку epm? [Y/n]

source: Check /etc/portage/package.mask
ru: Проверьте /etc/portage/package.mask

source: Manually: edit /etc/pacman.conf modifying IgnorePkg array
ru: Вручную: отредактируйте /etc/pacman.conf, изменив массив IgnorePkg

source: Check /etc/portage/package.mask (package.unmask)
ru: Проверьте /etc/portage/package.mask (package.unmask)

source: Manually: edit /etc/pacman.conf removing package from IgnorePkg line
ru: Вручную: отредактируйте /etc/pacman.conf, удалив пакет из строки IgnorePkg

source: mark is the interface for marking packages
ru: mark — это интерфейс для маркировки пакетов

source: Examples: epm mark hold mc epm manual mc
ru: Примеры: epm mark hold mc epm manual mc

source: Conflicts: Missing package(s) name
ru: Конфликты: Отсутствует название пакета(ов)

source: Unsupported $DISTRNAME
ru: Неподдерживаемый $DISTRNAME

source: epm status - check status of the package and return result via exit code Usage: epm status [options] <package> [version] Options: --installed [version] check if <package> is installed (if version is specified, not older than the version) --installable check if <package> can be installed from the repo --original check if <package> is from distro repo --certified check if <package> is certified that it can be installed without repacking --thirdparty check if <package> from a third-party source (didn't packed for this distro) --repacked check if <package> was repacked with epm repack --validate check if <package> is accessible (we can get a fields from it) --supported check if distribution is supported by epm status
ru: epm status - проверка состояния пакета и возврат результата через код выхода Использование: epm status [параметры] <пакет> [версия] Параметры: --installed [версия] проверить, установлен ли <пакет> (если указана версия, то не старше этой версии) --installable проверить, можно ли установить <пакет> из репозитория --original проверить, принадлежит ли <пакет> репозиторию дистрибутива --certified проверить, сертифицирован ли <пакет> для установки без перепаковки --thirdparty проверить, является ли <пакет> сторонним источником (не упакован для этого дистрибутива) --repacked проверить, был ли <пакет> перепакован с помощью epm repack --validate проверить, доступен ли <пакет> (можно ли получить из него поля) --supported проверить, поддерживается ли дистрибутив командой epm status

source: Unknown option $option, use epm status --help to get info
ru: Неизвестный параметр $option, используйте epm status --help для получения информации

source: No option before $option, use epm status --help to get info
ru: Нет параметра перед $option, используйте epm status --help для получения информации

source: policy command is not implemented for yum
ru: команда policy не реализована для yum

source: Repack deb to deb is not supported yet.
ru: Перепаковка deb в deb пока не поддерживается.

source: Repacking $abspkg to local deb format (inside $TDIR) ...
ru: Перепаковка $abspkg в локальный формат deb (внутри $TDIR) ...

source: Can't find converted deb for source binary package $pkg
ru: Не удается найти преобразованный deb для исходного двоичного пакета $pkg

source: Provides: package name is missed
ru: Provides: название пакета отсутствует

source: Use epm clean --direct to remove all downloaded indexes.
ru: Используйте epm clean --direct для удаления всех загруженных индексов.

source: Note: Also you can try (with CAUTION) '# epm autoremove' and '# epm autoorphans' commands to remove obsoleted and unused packages.
ru: Примечание: Также вы можете попробовать (с ОСТОРОЖНОСТЬЮ) команды '# epm autoremove' и '# epm autoorphans' для удаления устаревших и неиспользуемых пакетов.

source: Install: Empty install list was skipped.
ru: Установка: пропущен пустой список установки.

source: Please, use search with some argument or run epmqa for get all packages.
ru: Пожалуйста, используйте поиск с аргументом или запустите epmqa для получения всех пакетов.

source: You can use epm dedup also
ru: Вы также можете использовать epm dedup

source: Already loaded
ru: Уже загружено

source: Install eepm-play package to use epm play command.
ru: Установите eepm-play для использования команды epm play.

source: Options:
ru: Параметры:

source: Short commands:
ru: Короткие команды:

source: EPM package manager version $EPMVERSION Telegram: https://t.me/useepm https://wiki.etersoft.ru/Epm Running on $DISTRNAME/$DISTRVERSION ($PMTYPE package manager uses $PKGFORMAT package format) Copyright (c) Etersoft 2012-2025 This program may be freely redistributed under the terms of the GNU AGPLv3.
ru: Менеджер пакетов EPM версии $EPMVERSION Telegram: https://t.me/useepm https://wiki.etersoft.ru/Epm Работает на $DISTRNAME/$DISTRVERSION (менеджер пакетов $PMTYPE использует формат пакетов $PKGFORMAT) Авторские права (c) Etersoft 2012-2025 Эта программа может свободно распространяться на условиях GNU AGPLv3.

source: Usage: epm [options] <command> [package name(s), package files]...
ru: Использование: epm [параметры] <команда> [название пакета(ов), файлы пакета]...

source: epm - EPM package manager
ru: epm - менеджер пакетов EPM

source: --no-check-certificate is a wget option. It is recommended never use it at all. Check the date or upgrade your system.
ru: --no-check-certificate — это параметр wget. Рекомендуется не использовать его. Проверьте дату или обновите систему.

source: There are space(s) in filename $opt, it is not supported. Skipped
ru: В имени файла $opt есть пробелы, это не поддерживается. Пропущено

source: There are space(s) in directory path $opt, it is not supported. Skipped
ru: В пути к директории $opt есть пробелы, это не поддерживается. Пропущено

source: There are space(s) in URL $opt, it is not supported. Skipped
ru: В URL $opt есть пробелы, это не поддерживается. Пропущено

source: There are space(s) in package name $opt, it is not supported. Skipped.
ru: В имени пакета $opt есть пробелы, это не поддерживается. Пропущено.

source: There are forbidden symbols in package name $opt. Skipped.
ru: В имени пакета $opt есть запрещенные символы. Пропущено.

source: Popular commands: epm search <name> - search package by name epm install <package> - install package epm full-upgrade - do full upgrade (packages, kernel) of the system epm Upgrade - upgrade all installed packages (Upgrade = update + upgrade) epm play [application] - install the application (run without params to get list of available apps) epm qf (<command>|<path>) - print what package contains this command (file) epm sf <name> - search for the name in all files of all packages epm cl <package name> - print changelog for the package
ru: Популярные команды: epm search <название> - поиск пакета по названию epm install <пакет> - установка пакета epm full-upgrade - полное обновление системы (пакеты, ядро) epm Upgrade - обновление всех установленных пакетов (Upgrade = update + upgrade) epm play [приложение] - установка приложения (запустите без параметров для получения списка доступных приложений) epm qf (<команда>|<путь>) - показать, какой пакет содержит эту команду (файл) epm sf <название> - поиск названия во всех файлах всех пакетов epm cl <название пакета> - показать журнал изменений для пакета

source: Unrecognized command in $args arg(s)
ru: Нераспознанная команда в аргументах $args

source: That program needs be running with some command
ru: Эта программа должна быть запущена с какой-либо командой

source: Can't find $1 entries in the repos (see # epm repolist output)
ru: Не удается найти записи $1 в репозиториях (см. вывод # epm repo list)

source: Can't find '
ru: Не удается найти '

source: will comment $rp
ru: будет закомментировано $rp

source: run repo switch with arg (p9, p10, Sisyphus)
ru: выполните переключение репозитория с аргументом (p9, p10, Sisyphus)

source: Unsupported change key $1
ru: Неподдерживаемый ключ изменения $1

source: Repo change Unsupported for $BASEDISTRNAME
ru: Изменение репозитория не поддерживается для $BASEDISTRNAME

source: %%% You are trying install package $i repacked from third-party software source. Use it at your own risk. %%%
ru: %%% Вы пытаетесь установить пакет $i, перепакованный из стороннего источника ПО. Используйте на свой страх и риск. %%%

source: %%% You are trying install package $i from third-party software source. Use it at your own risk. %%%
ru: %%% Вы пытаетесь установить пакет $i из стороннего источника ПО. Используйте на свой страх и риск. %%%

source: %%% You are trying install package $i not from official $DISTRNAME/$DISTRVERSION repository. Use it at your own risk. %%%
ru: %%% Вы пытаетесь установить пакет $i не из официального репозитория $DISTRNAME/$DISTRVERSION. Используйте на свой страх и риск. %%%

source: Can't get any info for $i package. Scripts are DISABLED for package $bi. Use --scripts if you need run scripts from such packages.
ru: Не удается получить информацию для пакета $i. Скрипты ОТКЛЮЧЕНЫ для пакета $bi. Используйте --scripts, если необходимо запустить скрипты из таких пакетов.

source: Can't get info about vendor for $i package. Scripts are DISABLED for package $bi. Use --scripts if you need run scripts from such packages.
ru: Не удается получить информацию о поставщике для пакета $i. Скрипты ОТКЛЮЧЕНЫ для пакета $bi. Используйте --scripts, если необходимо запустить скрипты из таких пакетов.

source: Scripts are ENABLED for package $bi from outside vendor $vendor (this vendor is listed in $CONFIGDIR/vendorallowscripts.list). Use --noscripts if you need disable scripts in such packages.
ru: Скрипты ВКЛЮЧЕНЫ для пакета $bi от внешнего поставщика $vendor (этот поставщик перечислен в $CONFIGDIR/vendorallowscripts.list). Используйте --noscripts, если необходимо отключить скрипты в таких пакетах.

source: Scripts are ENABLED for package $bi from outside vendor $vendor (the package is listed in $CONFIGDIR/pkgallowscripts.list). Use --noscripts if you need disable scripts in such packages.
ru: Скрипты ВКЛЮЧЕНЫ для пакета $bi от внешнего поставщика $vendor (пакет перечислен в $CONFIGDIR/pkgallowscripts.list). Используйте --noscripts, если необходимо отключить скрипты в таких пакетах.

source: Scripts are DISABLED for package $bi from outside vendor $vendor. Use --scripts if you need run scripts from such packages.
ru: Скрипты ОТКЛЮЧЕНЫ для пакета $bi от внешнего поставщика $vendor. Используйте --scripts, если необходимо запустить скрипты из таких пакетов.

source: is_installed: package name is missed
ru: is_installed: название пакета отсутствует

source: Options: <receipt> - run <receipt> --list-all - list all available receipts
ru: Параметры: <рецепт> - запустить <рецепт> --list-all - перечислить все доступные рецепты

source: Run with a name of a prescription to run:
ru: Запустите с именем рецепта для запуска:

source: run --remove with receipt name
ru: запустите --remove с названием рецепта

source: We have no idea how to play $prescription (checked in $psdir)
ru: Мы не знаем, как выполнить $prescription (проверено в $psdir)

source: Check for duplicates (internal implementation) ...
ru: Проверка на дубликаты (внутренняя реализация) ...

source: Check for duplicates via apt-get dedup from apt-scripts (also you can use internal EPM dedup implementation with --direct option)
ru: Проверка на дубликаты через apt-get dedup из apt-scripts (также можно использовать внутреннюю реализацию dedup EPM с параметром --direct)

source: You can use dedup from apt-scripts package
ru: Вы можете использовать dedup из пакета apt-scripts

source: Do not know command for query file package
ru: Неизвестная команда для запроса файла пакета

source: Query: package name is missed
ru: Запрос: название пакета отсутствует

source: Try run $ft ...
ru: Попробуйте запустить $ft ...

source: Count lines:
ru: Подсчет строк:

source: Not yet implemented
ru: Пока не реализовано

source: Do not use checksystem under root
ru: Не используйте checksystem под root

source: Creating copy of all sources lists to $SAVELISTDIR ...
ru: Создание копии всех списков источников в $SAVELISTDIR ...

source: Can't save apt source list files to $SAVELISTDIR
ru: Не удается сохранить файлы списка источников apt в $SAVELISTDIR

source: Restoring copy of all sources lists from $SAVELISTDIR ...
ru: Восстановление копии всех списков источников из $SAVELISTDIR ...

source: Can't restore $i file
ru: Не удаётся восстановить файл $i

source: An error occurred...
ru: Произошла ошибка...

source: APT database is actual.
ru: База данных APT актуальна.

source: APT database is $days.
ru: База данных APT составляет $days.

source: Unknown ELF binary
ru: Неизвестный ELF бинарный файл

source: Requires: package name is missed
ru: Требуется: название пакета отсутствует

source: never downloaded
ru: никогда не загружался

source: 1 day old
ru: 1 день

source: $days days old
ru: $days дней

source: stalled
ru: застрял

source: APT database is $days, please run epm update!
ru: База данных APT устарела на $days. Вы можете выполнить epm update.

source: Removed packages history:
ru: История удалённых пакетов:

source: Installed packages history:
ru: История установленных пакетов:

source: Updated packages history:
ru: История обновлённых пакетов:

source: package management history
ru: история управления пакетами

source: Examples: epm history epm history --removed
ru: Примеры: epm history epm history --removed

source: Can't get package version
ru: Не удаётся получить версию пакета

source: Unsupported arch
ru: Неподдерживаемая архитектура

source: We support only WebDAVCloudMailRu....zip
ru: Мы поддерживаем только WebDAVCloudMailRu....zip

source: Use only for 1C-Connect-Linux-x64.tar.gz.
ru: Используйте только для 1C-Connect-Linux-x64.tar.gz.

source: Can't get version from dist.json file.
ru: Не удаётся получить версию из файла dist.json.

source: Can't get name from snap.yaml
ru: Не удаётся получить название из snap.yaml

source: Can't get version from snap.yaml
ru: Не удаётся получить версию из snap.yaml

source: Missed archive version
ru: Отсутствует версия архива

source: run with file looks like setup-full-8.3.22.1851-x86_64.run
ru: запустите с файлом, похожим на setup-full-8.3.22.1851-x86_64.run

source: Can't install
ru: Не удается установить

source: We support only cascadeur-linux.tgz
ru: Мы поддерживаем только cascadeur-linux.tgz

source: RETURNTARNAME is empty
ru: RETURNTARNAME пуст

source: We support only Pantum Ubuntu Driver V.*.zip
ru: Мы поддерживаем только Pantum Ubuntu Driver V.*.zip

source: There is no needed OpenSSL 3 in the system.
ru: В системе отсутствует необходимый OpenSSL 3.

source: Install CryptoPro before (install ecryptomgr package and check https://github.com/Etersoft/ecryptomgr )
ru: Установите CryptoPro заранее (установите пакет ecryptomgr и проверьте https://github.com/Etersoft/ecryptomgr )

source: lsb-cprocsp-capilite-64 is not installed. Use 'ecryptomgr install cryptopro' to install it.
ru: lsb-cprocsp-capilite-64 не установлен. Используйте 'ecryptomgr install cryptopro' для установки.

source: cprocsp-pki-cades-64 is not installed. Use 'ecryptomgr install cades' to install it.
ru: cprocsp-pki-cades-64 не установлен. Используйте 'ecryptomgr install cades' для установки.

source: Can't get version
ru: Не удается получить версию

source: glibc is too old
ru: glibc слишком старая

source: hplip package is not installed
ru: Пакет hplip не установлен

source: only ALT is supported.
ru: поддерживается только ALT.

source: virtualbox package is not installed
ru: Пакет virtualbox не установлен

source: Can't get version.
ru: Не удается получить версию.

source: glibc is too old, upgrade your system.
ru: glibc слишком старая, обновите свою систему.

source: Unsupported packaging system
ru: Неподдерживаемая система упаковки

source: Can't get package URL
ru: Не удается получить URL пакета

source: Can't get package URL. Try use epm play --latest <app> to get latest version.
ru: Не удаётся получить URL пакета. Попробуйте epm play --latest <app> для получения самой последней версии

source: Can't install requires packages.
ru: Невозможно установить необходимые пакеты.

source: Getting executable requires ...
ru: Получение зависимостей исполняемых файлов ...

source: Getting libs requires ...
ru: Получение зависимостей библиотек ...

source: Can't install needed binutils package
ru: Невозможно установить пакет binutils.

source: Getting internal provides ...
ru: Получение внутренних предоставляемых зависимостей ...

source: List of binary and libs requires:
ru: Список зависимостей бинарных файлов и библиотек:

source: End of the list binary and libs requires.
ru: Конец списка зависимостей бинарных файлов и библиотек.

source: List of libraries provided:
ru: Список предоставленных библиотек:

source: End of the provided libraries list.
ru: Конец списка предоставленных библиотек.

source: List of ignored libraries:
ru: Список игнорируемых библиотек:

source: End of the ignored libraries.
ru: Конец списка игнорируемых библиотек.

source: Skipping any requires detection ...
ru: Пропуск обнаружения зависимостей ...

source: Scanning for required libs soname ...
ru: Сканирование на наличие требуемых библиотек soname ...

source: Run me only via epm repack <package>
ru: Запускайте меня только через epm repack <пакет>

source: This package needs OpenSSL 3.
ru: Для этого пакета требуется OpenSSL 3.

source: libevent is missed, install it before
ru: Отсутствует libevent, установите его предварительно
